brew "vim"
brew "tmux"
brew "git"
brew "fzf"
brew "ripgrep"
brew "wget"
brew "node"
brew "python"
brew "gcc"
brew "ripgrep"

cask "docker"
cask "visual-studio-code"
cask "eloston-chromium"
cask "flux"
cask "kindle"
cask "qbittorrent"
cask "vlc"
