# Core tools
brew "git"
brew "git-lfs"
brew "gh"
brew "tmux"
brew "fzf"
brew "ripgrep"
brew "wget"
brew "htop"

# Languages & runtimes
brew "node"
brew "nvm"
brew "python"

# Databases
brew "postgresql@15"
brew "redis"

# Docker
brew "docker"
brew "docker-compose"
brew "colima"

# Casks
cask "cursor"
cask "tailscale"
cask "font-fira-code-nerd-font"
cask "visual-studio-code"
cask "flux-app"
cask "vlc"
